{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com","author":"Jared Nielsen"}},"markdownRemark":{"id":"63e3a632-035a-5325-8215-fc96983db77e","excerpt":"ESTRAGON: I can’t go on like this. VLADIMIR: That’s what you think. ― Samuel Beckett, Waiting for Godot Are things as bad as they seem right now? Breaking news…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/4459cd6292c9cdf707f0aa9d1980b270/ef9ea/jarednielsen-forkyeah-venn.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 56.25%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAYAAAB/Ca1DAAAACXBIWXMAAC4jAAAuIwF4pT92AAABPklEQVQoz42SzUrDQBCA+4i+iScFLz6CLyAoFQ9i6aH+lFjFgFrEg6hFPFUsVFpL0aRq/9Lsfk62SdmmtHUnk1l2Zr+Znd0M9tDRJz81tlqJ+jp2KHpaT0JVPDdeaz1DesQw3mVeFC2JluFWzJlsPBFtxQADtWCzwKTCAYxyI7y6L4shzt0Hh+VXul2fl2abXBAQmHi9pMIE2IShM6RHH7d6zsr+Ohura+y+7UimPpcS0oirWwo0RnrHEfj1Dsdenu2tC/LFKjfeFQU5vxMdQofj2IVHjgNM3m+oXddwXRfuTRspjDpsqlN+TGA4uZiFPbSzDkSyv1kqfoWvdoO91gHPwYPxhXLr1pYFQJ08C2Vu/FOkJOKIPvGYejJ6CZDpCg1UM6WJT+tZ2HyglTuySiSxdgz/BaY3pRPMg0XjD5iCVlHXBhciAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Fork Yeah venn diagram: Cooking, Activism, Computer Science\"\n        title=\"\"\n        src=\"/static/4459cd6292c9cdf707f0aa9d1980b270/fb8a0/jarednielsen-forkyeah-venn.png\"\n        srcset=\"/static/4459cd6292c9cdf707f0aa9d1980b270/1a291/jarednielsen-forkyeah-venn.png 148w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/2bc4a/jarednielsen-forkyeah-venn.png 295w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/fb8a0/jarednielsen-forkyeah-venn.png 590w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/526de/jarednielsen-forkyeah-venn.png 885w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/fa2eb/jarednielsen-forkyeah-venn.png 1180w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/08f6a/jarednielsen-forkyeah-venn.png 1770w,\n/static/4459cd6292c9cdf707f0aa9d1980b270/ef9ea/jarednielsen-forkyeah-venn.png 1920w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<blockquote>\n<p>ESTRAGON: I can’t go on like this.</p>\n<p>VLADIMIR: That’s what you think.</p>\n<p>― Samuel Beckett, Waiting for Godot</p>\n</blockquote>\n<p>Are things as bad as they seem right now?</p>\n<p>Breaking news is breaking my spirit.</p>\n<p>Walls.</p>\n<p>Bans.</p>\n<p>Anger.</p>\n<p>Fear.</p>\n<p>Death.</p>\n<p>But.</p>\n<p>We can’t let politics distract us from the elephant in the room.</p>\n<p>Life.</p>\n<p>We must go on.</p>\n<p>And so too our progeny.</p>\n<p>2016 was the fourth-warmest year on record. The third in three consecutive record-breaking years.</p>\n<p>It’s about to get hot AF.</p>\n<p>I don’t know about you, but I like this planet. I don’t want to live on Mars. Moving across town is stressful enough.</p>\n<p>So what do we do?</p>\n<p>We get healthy.</p>\n<p>Whether you plan to join the anarchists or run for office, you need a sharp mind and a strong body.</p>\n<p>I don’t know how we’re going to un-fuck ourselves. I don’t have solutions to far-right populism or global warming.</p>\n<p>I do know that we gotta eat.</p>\n<p>And we can thrive on plants alone.</p>\n<p>Livestock production is responsible for more greenhouse gas emissions than all forms of transportation combined.  </p>\n<p>That’s right.</p>\n<p>Planes, trains and automobiles are less bad than adorable burping poop-machines.</p>\n<p>Numerous studies show that switching to a plant-based diet, or even eating within the recommended guidelines for meat consumption, will significantly reduce food-related greenhouse gas emissions.</p>\n<p>And by significant, I’m talking 70% reduction for veganism.</p>\n<p>That’s huge.</p>\n<p>You know what else is huge?</p>\n<p>The amount of water meat production sucks up. It takes approximately 4 million gallons of water to produce one ton of beef. One ton of vegetables, on the other hand, only requires somewhere between 50,000-100,000 gallons per ton, depending on the crop.</p>\n<p>Maths.</p>\n<p>Do them.</p>\n<p>Unless you’ve been eating too much meat.</p>\n<p>It’s our world.</p>\n<p>If you don’t like where it’s going, fork it!</p>\n<p>Start with food.</p>\n<p>Feed that head.</p>\n<p>The future needs smart cookies.</p>\n<p>Gluten-free, sugar-free cookies with stamina and focus.</p>\n<p>What does the future look like to you?</p>\n<p>How are you eating your way there?</p>\n<h2>What is Fork Yeah!?</h2>\n<p>Fork Yeah! merges cooking, computer science and activism. If you’re not interested in any of those, you’re in the wrong place. Beat it.</p>\n<ul>\n<li>Fork Yeah! recipes are gluten-free, sugar-free, soy-free and vegan.</li>\n<li>Fork Yeah! recipes are curated to optimize energy stability and boost brain function so you can spend your precious time feeling alert and alive. No more peaks and valleys. No more crash and burn.</li>\n<li>Fork Yeah! recipes are structured for speed and ease of preparation. The directions are written to maximize efficiency and readability without ambiguity.</li>\n<li>Fork Yeah! recipes constitute a functional ecosystem so you won’t have a cupboard full of random ingredients. Collectively, they are organized for maximum return-on-investment.</li>\n<li>Fork Yeah! will teach you how to make a recipe your own and make it better, or, fork it.  </li>\n<li>Fork Yeah! dives into the science of cooking so you can make it an art.</li>\n</ul>\n<p>Fork Yeah! will make you smart AF (As Fork).</p>\n<p>The idea is to learn to cook, not follow recipes.</p>\n<p>Clone the book to your head.</p>\n<h2>What is Git?</h2>\n<p>Cooking is an art and a science. It’s a fundamental skill. It’s not hard. You don’t have to be a rockstar. You just need to know the basics.</p>\n<p>Coding is an art and a science. In the 21st century, it’s a fundamental skill. It’s also not hard. You don’t have to be a rockstar. You just need to know the basics.</p>\n<p>Git is a version control system. It is most commonly used to develop software.</p>\n<p>Say you’re writing a program and you want to test a new feature. You could copy all of your files to a new folder, code the feature, test it, and if you like the result, copy/paste the changes back into the original files.</p>\n<p>Or you could use Git.</p>\n<p>Git tracks changes in files, allowing you to try new things easily and efficiently without commitment. Doing this is called branching. If you like what you see on the branch, you commit and merge the changes back to the trunk of the tree, or the master.</p>\n<p>If you want to modify, improve, or pervert someone else’s project, you fork it, and make it your own.</p>\n<h2>What is GitHub?</h2>\n<p>GitHub is a web-based version of Git. You can store your files and projects in repositories, or repos. You can browse the projects of other developers and fork or clone them, which means to download it to your computer.</p>\n<p>Fork Yeah! uses Github to host its recipes and its website.</p>\n<h2>Do You Need to Learn to Code or Use Git?</h2>\n<p>You don’t have to use Git or learn to code to get the most out of Fork Yeah!</p>\n<p>But you’re dually badass if you do.</p>\n<p>If you want to learn how to use Git and GitHub, start <a href=\"https://guides.github.com/activities/hello-world/\">here</a>.</p>\n<p>If you want to get smart, <a href=\"http://eepurl.com/cDweO5\">sign up for the newsletter</a>.</p>\n<p>Go Fork.</p>\n<p>Do great things.</p>","frontmatter":{"title":"Cooking, Computer Science, and Activitsm? Fork Yeah!","date":"December 23, 2019","description":"Fork Yeah! merges cooking, computer science and activism. If you’re not interested in any of those, you’re in the wrong place. Beat it."}}},"pageContext":{"slug":"/fork-yeah-cooking-computer-science-activism/","previous":{"fields":{"slug":"/2020-best-podcasts-web-developers/"},"frontmatter":{"title":"Best Podcasts for Web Developers in 2020"}},"next":null}}