{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"@TODO plug newsletter  http://eepurl.com/cP8CMn You don’t need to be a math whiz to be a good programmer, but there are a handful of tricks…","fields":{"slug":"/sum-consecutive-integers/"},"frontmatter":{"date":"Invalid date","title":"How to Sum Consecutive Integers 1 to n","description":"“In this tutorial, you will learn how to sum a series of consecutive integers from 1 to n with a simple and easy to remember equation.”"}}},{"node":{"excerpt":"Is there a computer science topic more terrifying than Big O notation? Don’t let the name scare you, Big O notation is not a big deal. It’s…","fields":{"slug":"/big-o-linear-time-complexity/"},"frontmatter":{"date":"January 27, 2020","title":"Big O Linear Time Complexity","description":"Big O notation is not a big deal. Learn the fundamentals of Big O linear time complexity with examples in JavaScript."}}},{"node":{"excerpt":"Is there a computer science topic more terrifying than Big O notation? Don’t let the name scare you, Big O notation is not a big deal. It’s…","fields":{"slug":"/big-o-notation/"},"frontmatter":{"date":"January 20, 2020","title":"What is Big O Notation? The Superlative Guide","description":"Big O notation is not a big deal. Learn the fundamentals of Big O notation, beginning with constant time complexity with examples in JavaScript."}}},{"node":{"excerpt":"My first full-time job was teaching wilderness survival to adjudicated youth in the deserts of Utah. Though the technologies were primitive…","fields":{"slug":"/programming-problem-solving/"},"frontmatter":{"date":"January 13, 2020","title":"Programming is Problem Solving","description":"Programming and problem solving are metacognitive activities. The key to success in both is learning how to think about thinking."}}},{"node":{"excerpt":"Software developers create GitHub repositories to host the code for their projects, but we can create a GitHub repository for any purpose…","fields":{"slug":"/create-github-repository-first-commit/"},"frontmatter":{"date":"January 03, 2020","title":"Create a GitHub Repository and Your First Commit","description":"Software developers create GitHub repositories to host the code for their projects, but we can create a GitHub repository for any purpose, like recipes!"}}},{"node":{"excerpt":"There’s more than one way to scaffold a boilerplate MERN application and deploy it to Heroku. This method is straightforward and easy to…","fields":{"slug":"/mern-deploy-heroku/"},"frontmatter":{"date":"December 30, 2019","title":"How to Scaffold a Boilerplate MERN Application and Deploy to Heroku","description":"There's more than one way to scaffold a boilerplate MERN application and deploy it to Heroku. This method is straightforward and easy to maintain."}}},{"node":{"excerpt":"If you want to get smart AF,  sign up for the Fork Yeah! newsletter . ESTRAGON: I can’t go on like this. VLADIMIR: That’s what you think…","fields":{"slug":"/fork-yeah-cooking-computer-science-activism/"},"frontmatter":{"date":"December 27, 2019","title":"Cooking, Computer Science, and Activitsm? Fork Yeah!","description":"Fork Yeah! merges cooking, computer science and activism. If you’re not interested in any of those, you’re in the wrong place. Beat it."}}},{"node":{"excerpt":"Maintaining a healthy work-life balance is important when you’re a developer. Especially if you work remote. When I set up a new development…","fields":{"slug":"/create-cron-job-change-default-browser-work-life-balance/"},"frontmatter":{"date":"December 23, 2019","title":"Create a Cron Job to Change Default Browser for Work-Life Balance","description":"Maintaining a healthy work-life balance is important when you're a developer. Especially if you work remote. When I set up a new development environment, I create a cron job to change the default browser between work and 'play' hours."}}},{"node":{"excerpt":"Keeping up with the changing pace of technology is part and parcel of being a web developer. Listening to podcasts is a great way to stay…","fields":{"slug":"/2020-best-podcasts-web-developers/"},"frontmatter":{"date":"December 16, 2019","title":"Best Podcasts for Web Developers in 2020","description":"Keeping up with the changing pace of technology is part and parcel of being a web developer. Listening to podcasts is a great way to stay informed and give your eyes a break. Unless you are independently wealthy or a short sleeper, there aren’t enough hours in the day to listen to all of them. Here are the best podcasts for web developers in 2020."}}},{"node":{"excerpt":"Here is a list of the best newsletters for web developers in 2020. By best I mean  my favorite . Of the many great newsletters available for…","fields":{"slug":"/2020-best-newsletters-web-developers/"},"frontmatter":{"date":"December 09, 2019","title":"Best Newsletters for Web Developers in 2020","description":"Of the many great newsletters available for web developers, these are the 10 that I find give me a well-rounded perspective on current trends and must-know developments in our field with minimal redundancy and maximal entertainment value."}}},{"node":{"excerpt":"If you’re like me, it’s hard to turn off the problem-solving part of the brain and just relax. That’s why puzzle video games were invented…","fields":{"slug":"/puzzle-video-games-problem-solving/"},"frontmatter":{"date":"December 02, 2019","title":"Best Puzzle Video Games to Level Up Problem Solving Skills","description":"Level up your problem solving skills with the best puzzle video games on Steam Linux."}}},{"node":{"excerpt":"Scrum is the most popular agile process, and  Essential Scrum: A Practical Guide to the Most Popular Agile Process by Kenneth S. Rubin  is…","fields":{"slug":"/book summary/essential-scrum-kenneth-rubin/"},"frontmatter":{"date":"April 15, 2019","title":"Essential Scrum by Kenneth S. Rubin","description":"Scrum is the most popular agile process, and Essential Scrum by Kenneth S. Rubin is arguably the most popular book on the topic. The problem that Scrum seeks to solve is how do we empower teams to identify and solve their own problems?"}}},{"node":{"excerpt":"Other than agile  itself , perhaps the most important aspect of agile software development is the retrospective. This is where the iteration…","fields":{"slug":"/book summary/agile-retrospectives-esther-derby-diana-larsen/"},"frontmatter":{"date":"April 08, 2019","title":"Agile Retrospectives by Esther Derby and Diana Larsen","description":"The problem that agile retrospectives seeks to solve is how to solve problems. Let's get meta!"}}},{"node":{"excerpt":"From cave drawings and hand-carved flutes to CPUs and machine learning, we, humans, have always been hackers. Our evolution is technology…","fields":{"slug":"/we-have-always-been-hackers/"},"frontmatter":{"date":"April 01, 2019","title":"We Have Always Been Hackers","description":"From cave drawings and hand-carved flutes to CPUs and machine learning, we, humans, have always been hackers. Our evolution is technology. We didn't appear in the Garden of Eden and, upon being cast out, grudgingly pick up hoe and axe. Did we evolve to use tools or did tools evolve us?"}}},{"node":{"excerpt":"Whether you are working with open-source or private repositories, you will want to learn the Git fork and pull request workflow. The biggest…","fields":{"slug":"/learn-git-fork-pull-request/"},"frontmatter":{"date":"February 25, 2019","title":"Learn Git Fork & Pull Request Workflow","description":"Whether you are working with open-source or private repositories, you will want to learn the Git fork and pull request workflow. This tutorial will walk you through a real-world example."}}},{"node":{"excerpt":"One of the most useful aspects of Git is the ability for developers to create branches of a project to test new features and fix bugs…","fields":{"slug":"/learn-git-branch-workflow/"},"frontmatter":{"date":"February 18, 2019","title":"Learn Git Branch Workflow","description":"The Git branch workflow allows developers to create branches of a project to test new features and fix bugs without modifying code in production. In this tutorial, you will learn Git branch workflow basics and best practices."}}},{"node":{"excerpt":"The most powerful, and sometimes powerfully frustrating, aspect of Git is the collaborative workflow it enables. In order to  really  learn…","fields":{"slug":"/learn-git-workflow-centralized/"},"frontmatter":{"date":"February 11, 2019","title":"Learn Git Workflow Centralized Collaboration","description":"In order to learn Git workflow, you need to work with a team. This tutorial introduces the centralized model for collaboration and is designed for two to work through together."}}},{"node":{"excerpt":"Whether you’re learning full stack web development, machine learning or something else entirely, you’re going to need to learn Git workflow…","fields":{"slug":"/learn-git-workflow-basics/"},"frontmatter":{"date":"February 04, 2019","title":"Learn Git Workflow Basics","description":"Whether you're learning full stack web development, machine learning or something else entirely, you're going to need to learn Git workflow basics."}}},{"node":{"excerpt":"Gonna learn this VSCode thing all the kids are talking about so I made a map of key bindings to reference plus some basic config stuff. I…","fields":{"slug":"/atom-vscode-key-binding-map/"},"frontmatter":{"date":"January 28, 2019","title":"Atom & VSCode Key Binding Map & Configurations","description":"Gonna learn this VSCode thing all the kids are talking about so I made a map of key bindings to reference."}}},{"node":{"excerpt":"My preferred development environment is Linux and my preferred approach to upgrading my distro is a clean install. This means with each…","fields":{"slug":"/full-stack-development-linux/"},"frontmatter":{"date":"January 21, 2019","title":"How to Configure Full-Stack Development Environment for Linux","description":"A quick reference for setting up a full-stack development environment on Linux, including instructions for Git, Node.js, MySQL, MongoDB and more."}}},{"node":{"excerpt":"If you’ve used jQuery’s AJAX, the fetch API, or Axios for HTTP requests, you’ve used JavaScript Promises. When you’re first learning web…","fields":{"slug":"/javascript-promises/"},"frontmatter":{"date":"January 14, 2019","title":"Learn JavaScript Promises and Promise Methods","description":"Resolve to learn how JavaScript Promises work this year. This tutorial will introduce you to the Promise object and the resolve, reject, finally, all and race Promise methods."}}},{"node":{"excerpt":"Installing the NVIDIA Cuda Toolkit on Linux for Blender Cycles rendering is actually easy and straightforward. Unfortunately, the NVIDIA…","fields":{"slug":"/install-nvidia-cuda-linux-blender-cycles/"},"frontmatter":{"date":"January 07, 2019","title":"How to Install NVIDIA Cuda Toolkit on Linux for Blender 2.8 Cycles","description":"Installing the NVIDIA Cuda Toolkit on Linux for Blender Cycles rendering is straightforward and much easier than the official documentation leads you to believe."}}},{"node":{"excerpt":"Understanding object-relational mapping can be challenging when you’re first learning web development. In this tutorial, you will roll-your…","fields":{"slug":"/object-relational-mapping-javascript-orm/"},"frontmatter":{"date":"December 31, 2018","title":"What is Object-Relational Mapping? How to Roll-Your-Own JavaScript ORM","description":"This tutorial will walk you through a simple implementation of object-relational mapping to help you better understand how a full-featured JavaScript ORM, such as Sequelize, works under-the-hood."}}},{"node":{"excerpt":"Here is a list of the best newsletters for web developers in 2019. By best I mean  my favorite . Of the many great newsletters available for…","fields":{"slug":"/2019-best-newsletters-web-developers/"},"frontmatter":{"date":"December 24, 2018","title":"Best Newsletters for Web Developers in 2019","description":"Here is a list of the best newsletters for web developers in 2019. By best I mean my favorite."}}},{"node":{"excerpt":"I teach a coding bootcamp at a prominent university. After graduating six cohorts and more than 100 individuals in full stack web…","fields":{"slug":"/advice-coding-bootcamp-students/"},"frontmatter":{"date":"December 17, 2018","title":"Advice for Coding Bootcamp Students","description":"Considering a coding bootcamp? Already enrolled? Here’s my advice for coding bootcamp students to ensure a successful career transition."}}},{"node":{"excerpt":"My first full-time job was teaching wilderness survival to adjudicated youth in the deserts of Utah. Though the technologies were primitive…","fields":{"slug":"/teach-adults-code/"},"frontmatter":{"date":"December 10, 2018","title":"How to Teach Adults to Code","description":"When we teach adults to code, we ensure success by cultivating a growth mindset with problem-solving heuristics, articulate language and fun."}}},{"node":{"excerpt":"GatsbyJS is a great option for a static site generator, even if you’re unfamiliar with React. It’s very easy to use, super snappy, and has a…","fields":{"slug":"/deploy-gatsbyjs-github-pages-user/"},"frontmatter":{"date":"November 26, 2018","title":"How to Deploy a GatsbyJS Blog on GitHub Pages as a User Site","description":"Hosting a GatsbyJS blog on GitHub Pages for your user site requires additional configuration. Here's how to deploy."}}},{"node":{"excerpt":"I recently discovered the  Digital Collections  archived and made public by the Library of Congress. The collections range from historical…","fields":{"slug":"/make-interactive-story-map-leaflet-non-geographical-images/"},"frontmatter":{"date":"May 22, 2017","title":"How to Make an Interactive Story Map Using Leaflet.js and Non-Geographical Images","description":"It's easier than you think to make an interactive story map with Leaflet.js and non-geographical images. This tutorial walks you through how I did it using the Pictorial St. Louis collection from the Library of Congress."}}},{"node":{"excerpt":"@TODO plug newsletter  http://eepurl.com/cP8CMn {{ PASTE CONTENT HERE }} Repeat Title for SEO","fields":{"slug":"/template/_index/"},"frontmatter":{"date":"January 01, 1970","title":"60-65 characters or less","description":"~155-160 characters"}}}]}},"pageContext":{}}