{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com","author":"Jared Nielsen"}},"markdownRemark":{"id":"0422b2e0-2326-5481-9785-21845da2b9fa","excerpt":"Scrum is the most popular agile process, and  Essential Scrum: A Practical Guide to the Most Popular Agile Process by Kenneth S. Rubin  is arguably the most…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/75c43b87b6827ca0b864d640b1cd0f1b/c1266/essential-scrum.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 52.5%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAQFBv/EABQBAQAAAAAAAAAAAAAAAAAAAAH/2gAMAwEAAhADEAAAAXZ1BMNAAv8A/8QAHBAAAgEFAQAAAAAAAAAAAAAAAQQAAwUREyE0/9oACAEBAAEFAn/OgMV5cOLok7Z//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFREBAQAAAAAAAAAAAAAAAAAAARD/2gAIAQIBAT8BZ//EABkQAAIDAQAAAAAAAAAAAAAAAAABEGKBcf/aAAgBAQAGPwLR8jRKsf/EABoQAQACAwEAAAAAAAAAAAAAAAEAERAhMVH/2gAIAQEAAT8hq7crOexbaeYpDow//9oADAMBAAIAAwAAABBUD//EABURAQEAAAAAAAAAAAAAAAAAAAEQ/9oACAEDAQE/EGf/xAAVEQEBAAAAAAAAAAAAAAAAAAAQMf/aAAgBAgEBPxCT/8QAHBABAAEEAwAAAAAAAAAAAAAAAREAEDFRIUGB/9oACAEBAAE/ECUnp+1lEHgvZaUkOud1kQUIM2//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Essential Srum: A Practical Guide to the Most Popular Agile Process by Kenneth S. Rubin\"\n        title=\"\"\n        src=\"/static/75c43b87b6827ca0b864d640b1cd0f1b/f8fb9/essential-scrum.jpg\"\n        srcset=\"/static/75c43b87b6827ca0b864d640b1cd0f1b/e8976/essential-scrum.jpg 148w,\n/static/75c43b87b6827ca0b864d640b1cd0f1b/63df2/essential-scrum.jpg 295w,\n/static/75c43b87b6827ca0b864d640b1cd0f1b/f8fb9/essential-scrum.jpg 590w,\n/static/75c43b87b6827ca0b864d640b1cd0f1b/85e3d/essential-scrum.jpg 885w,\n/static/75c43b87b6827ca0b864d640b1cd0f1b/d1924/essential-scrum.jpg 1180w,\n/static/75c43b87b6827ca0b864d640b1cd0f1b/c1266/essential-scrum.jpg 1200w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Scrum is the most popular agile process, and <a href=\"https://amzn.to/39cryel\">Essential Scrum: A Practical Guide to the Most Popular Agile Process by Kenneth S. Rubin</a> is arguably the most popular book on the topic. The problem that Scrum seeks to solve is how do we empower teams to identify and solve their own problems? The following book summary is a combination of my notes and quotes.</p>\n<p><em>Note: Amazon links are affiliate.</em></p>\n<h2>Book Summary of <em>Essential Scrum: A Practical Guide to the Most Popular Agile Process</em> by Kenneth S. Rubin</h2>\n<blockquote>\n<p>Scrum is an agile approach for developing innovative products and services.</p>\n</blockquote>\n<blockquote>\n<p>With an agile approach, you begin by creating a <strong>product backlog</strong> — a prioritized list of the features and other capabilities needed to develop a successful product. Guided by the product backlog, you always work on the most important or highest-priority items first. When you run out of resources (such as time), any work that didn’t get completed will be of lower priority than the completed work. </p>\n</blockquote>\n<blockquote>\n<p>The work itself is performed in short, timeboxed <strong>iterations</strong>, which usually range from a week to a calendar month in length. During each iteration, a self-organizing, <strong>cross-functional team</strong> does all of he work — such as designing, building, and testing — required to produce complete, working features that could be put into production.</p>\n</blockquote>\n<blockquote>\n<p>Typically the amount of work in the product backlog is much greater than can be completed by a team in one short-duration iteration. So, at the start of each iteration, the team plans which high-priority subset of the product backlog to create in the upcoming iteration.</p>\n</blockquote>\n<blockquote>\n<p>At the end of the iteration, the team reviews the complete features with the stakeholders to get their feedback. Based on the feedback, the product owner and team can alter both they plan to work on next and how the team plans to do the work.</p>\n</blockquote>\n<blockquote>\n<p>At the end of each iteration, the team should have a potentially shippable product (or increment of the product), one that can be released if appropriate. </p>\n</blockquote>\n<h3>Can Scrum Help You?</h3>\n<blockquote>\n<p>Scrum’s focus on delivering working, integrated, tested, business-valuable features each iteration leads to results being delivered fast. Scrum is also well suited to help organizations succeed in a complex world where they must quickly adapt based on the interconnected actions of competitors, customers, users, regulatory bodies, and other stakeholders. And Scrum provides more joy for all participants. Not only are customers delighted, but also the people doing the work actually enjoy it! They enjoy frequent and meaningful collaboration, leading to improved interpersonal relationships and greature mutual trust among team members.</p>\n</blockquote>\n<blockquote>\n<p>Though Scrum is an excellent solution for many situations, it is not the proper solution in all circumstances. The <strong>Cynefin framework</strong> (Snowden and Boone 2007) is a sense-making framework that helps us understand the situation in which we have to operate and decide on a situation-appropriate approach. </p>\n</blockquote>\n<h4>Cynefin Framework</h4>\n<ul>\n<li>\n<p>Complex domain:</p>\n<ul>\n<li>“This is the domain of emergence. We need to explore to learn about the problem, then inspect and adapt based on our learning.”</li>\n<li>“If there is a right answer, we will know it only with hindsight.”</li>\n<li>“Scrum is particularly well suited for operating in a complex domain. In such situations our ability to prove (explore), sense (inspect), and respond (adapt) is critical.”</li>\n</ul>\n</li>\n<li>\n<p>Complicated domain:</p>\n<ul>\n<li>“Complicated problems are the domain of good practices dominated by experts. There might be multiple right answers, but expert diagnosis is required to figure them out.”</li>\n<li>Because of this, Scrum is not the best solution for these types of problems.</li>\n</ul>\n</li>\n<li>\n<p>Simple domain</p>\n<ul>\n<li>“When dealing with simple problems, everyone can see cause and effect. Often the right answer is obvious and undisputed. This is the domain of legitimate best practices. There are known solutions.”</li>\n<li>Scrum is not the most efficient tool for this type of problem.</li>\n<li>“Using a process with a well-defined, repeatable set of steps that are known to solve the problem would be a better fit.”</li>\n</ul>\n</li>\n<li>\n<p>Chaotic domain</p>\n<ul>\n<li>“Chaotic problems require a rapid response. We are in a crisis and need to act immediately to prevent further harm and reestablish at least som order”</li>\n<li>\n<p>Scrum is not the best solution here. </p>\n<ul>\n<li>“With chaotic problems, someone needs to take charge of the situation and act.” </li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Disorder</p>\n<ul>\n<li>“You are in the disorder domain when you don’t know which of the other domains you are in.”</li>\n<li>When you are in the disorder domain, they way out is to break down the situation into constituent parts and assign each to one of the other four domains You are not trying to apply Scrum in the disorder domain; you are trying to get out of this domain.”</li>\n</ul>\n</li>\n</ul>\n<blockquote>\n<p>Scrum is not a silver bullet or a magic cure. Scrum can, however, enable you to embrace the changes that accompany all complex <strong>product development efforts</strong>.</p>\n</blockquote>\n<blockquote>\n<p>Although the Scrum framework is simple, it would be a mistake to assume that Scrum is easy and painless to apply. Scrum doesn’t prescriptively answer your process questions; instead, it empowers teams to ask and answer their own great questions. Scrum doesn’t give individuals a cookbook solution to all of their organizational maladies; instead, Scrum makes visible the dysfunctions and waste that prevent organizations from reaching their true potential.</p>\n</blockquote>\n<h3>Scrum Framework</h3>\n<h4>Scrum Roles</h4>\n<ul>\n<li>\n<p>Product Owner</p>\n<ul>\n<li>The empowered central point of product leadership.</li>\n<li>The product owner maintains and communicates to all other participants a clear vision of what the Scrum team is trying to achieve.</li>\n</ul>\n</li>\n<li>\n<p>ScrumMaster</p>\n<ul>\n<li>Helps everyone involved understand and embrace the Scrum values, principles, and practices. </li>\n<li>Acts as a coach, providing process leadership and helping the Scrum team and the rest of the organization develop their own high-performance, organization-specific Scrum approach.</li>\n<li>Helps the team resolve issues and make improvements to its use of Scrum.</li>\n<li>Responsible for protecting the team from outside interference and takes a leadership role in removing impediments that inhibit team productivity.</li>\n</ul>\n</li>\n<li>\n<p>Development Team</p>\n<ul>\n<li>A diverse, cross-functional collection of architects, programmers, testers, database administrators, UI designers, and so on, who are responsible for designing, building and testing the desired product. </li>\n</ul>\n</li>\n</ul>\n<h4>Scrum Activities and Artifacts</h4>\n<ul>\n<li>Product backlog</li>\n<li>Sprints</li>\n<li>Sprint Planning</li>\n<li>Sprint Execution</li>\n<li>Daily Scrum</li>\n<li>Done</li>\n<li>Defined as a potentially shippable product increment</li>\n<li>Sprint Review</li>\n<li>Sprint Retrospective</li>\n</ul>\n<h3>Agile Principles</h3>\n<h4>Scrum vs. Plan-driven Development</h4>\n<blockquote>\n<p>Plan-driven processes (waterfall, tradiational, sequential, anticipatory, predictive or prescriptive development processes )are so named because they attempt to plan for and anticipate up front all of the features a user might want in the end product, and to determine how best to build those features. The idea here is that the better the planning, the better the understanding, and therefore the better the execution. </p>\n</blockquote>\n<blockquote>\n<p>Plan-driven development works well if you are applying it to problems that are well defined, predictable, and unlikely to undergo any significant change. The problem is that most product development efforts are anything but predictable, especially at the beginning. So, while a plan-driven process gives the impression of an orderly, accountable, and measurable approach, that impression can lead to a false sens of security. After all, developing a product rarely goes as planned. [P]lan-driven development approaches are based on a set of beliefs that do not match the uncertainty inherent in most product development efforts.</p>\n</blockquote>\n<blockquote>\n<p>Scrum, on the other hand, is based on a different set of beliefs — ones that do map well to problems with enough uncertainty to make high levels or predictability difficult. </p>\n</blockquote>\n<ul>\n<li>\n<p>Variability and uncertainty</p>\n<ul>\n<li>\n<p>Embrace helpful variability</p>\n<ul>\n<li>In product development… the goal is to create the unique <em>single instance</em> of the product, not to <em>manufacture</em> the product. This single instance is analogous to a unique recipe. We don’t want to create the same recipe twice; if we do, we have wasted our money. </li>\n</ul>\n</li>\n<li>\n<p>Employ iterative and incremental development</p>\n<ul>\n<li><strong>Iterative development</strong> acknowledges that we will probably get hings wrong before we get them right and that we weill do things poorly before we do them well. As such, iterative development is a planned rework strategy.</li>\n<li>The biggest downside to iterative development is that in the presence of uncertainty it can be difficult up front to determine (plan) how many improvement passes will be necessary.</li>\n<li><strong>Incremental development</strong> is based on the age-old principle of “Build some of it before you build all of it”. We avoid having one large, big-bang-style event at the end of development where all the pieces come together and the entire product is delivered. Instead, we break the product into smaller pices so that we can build some of it, learn how each piece is to survive in the environment in which it must exist, adapt based on what we learn, and then build more of it. </li>\n<li>The biggest drawback to incremental development is that by building in pieces, we risk missing the big picture (wee see the trees but not the forest).</li>\n<li>In Scrum, we don’t work on a phase at a time; we work on a feature at a time.</li>\n<li>We receive feedback… which allows us to adapt. Scrum does not require that we predetermine a set number of iterations. The continuous stream of feedback will guide us to do the appropriate and economically sensible number of iteration while developing the product incrementally.</li>\n</ul>\n</li>\n<li>\n<p>Leverage Variability through Inspection, Adaptation and Transparency</p>\n<ul>\n<li>Scrum embraces the fact that in product development, some level of variability is required in order to build something new. Scrum also assumes that the process necessary to create the product is complex and therefore would defy a complete up-front definition. Furthermore, it generates early and frequent feedback to ensure that the right product is built and that the product is built right.</li>\n<li>To do this well, we rely on transparency: all of the information that is important to producing a product must be available to the people involved in creating the product. </li>\n</ul>\n</li>\n<li>\n<p>Reduce All Forms of Uncertainty Simultaneously</p>\n<ul>\n<li>End uncertainty (what)</li>\n<li>Means uncertainty (how)</li>\n<li>In Scrum, we do not constrain ourselves by fully addressing one type of uncertainty before we address the next type. Instead, we take a more holistic approach and focus on simultaneously reducing all uncertainties.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Prediction and adaptation</p>\n<ul>\n<li>\n<p>We are constantly balancing the desire for prediction with the need for adaptation. How?</p>\n<ul>\n<li>Keep options open</li>\n<li>\n<p>Last responsible moment</p>\n<ul>\n<li>We delay commitment and do not make important and irreversible decisions until the last responsible moment</li>\n<li>And when is that? When the cost of not making a decision becomes greater than the cost of making a decision</li>\n</ul>\n</li>\n<li>\n<p>Accept that you can’t get it right up front</p>\n<ul>\n<li>In Scrum, we acknowledge that we can’t get all of the requirements or the plans right up front. In fact, we believe that trying to do so could be dangerous because we are likely missing important knowledge</li>\n</ul>\n</li>\n<li>\n<p>Favor an adaptive, exploratory approach</p>\n<ul>\n<li>When faced with uncertainty, we buy information by exploring</li>\n</ul>\n</li>\n<li>\n<p>Embrace change in an economically sensible way</p>\n<ul>\n<li>In Scrum, we assume that change is the norm</li>\n<li>Manage the amount of work in process and the flow of that work so that the cost of change is less affected by time that it is with sequential projects</li>\n</ul>\n</li>\n<li>\n<p>Balance predictive up-front work with adaptive just-in-time work</p>\n<ul>\n<li>Up-front work should be helpful without being excessive</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Validated learning</p>\n<ul>\n<li>\n<p>Validate important assumptions fast</p>\n<ul>\n<li>Assumptions represent a significant development risk</li>\n</ul>\n</li>\n<li>\n<p>Leverage multiple concurrent learning loops</p>\n<ul>\n<li>Constant learning is a key to our success</li>\n</ul>\n</li>\n<li>\n<p>Organize workflow for fast feedback</p>\n<ul>\n<li>We ensure that feedback generating activities occur in close time proximity to the original work</li>\n<li>Fast feedback closes the learning loop quickly, allowing us to truncate bad development paths before they can cause serious economic damage.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Work-in-progress (WIP)</p>\n<ul>\n<li>\n<p>Use economically small batches</p>\n<ul>\n<li>Single piece flow over all-before-any</li>\n</ul>\n</li>\n<li>\n<p>Recognize inventory and manage it for good flow</p>\n<ul>\n<li>Although we need some requirements if we are going to start development, we don’t need to have <em>all</em> of the requirements. If we have too many requirements, we will likely experience inventory waste when requirements changes. On the other hand, if we don’t have enough requirements inventory, we will disrupt the fast flow of work, which is also a form of waste.</li>\n</ul>\n</li>\n<li>\n<p>Focus on Idle work, not idle workers</p>\n<ul>\n<li>Idle work is something we want to do but can’t do because something is preventing us</li>\n<li>“Watch the baton, not the runners”</li>\n<li>You don’t win the race (deliver products) when the baton is on the ground.</li>\n</ul>\n</li>\n<li>Consider cost of delay</li>\n</ul>\n</li>\n<li>\n<p>Progress</p>\n<ul>\n<li>\n<p>Adapt to real-time information and replan</p>\n<ul>\n<li>Our goal is to rapidly replan and adapt to the stream of economically important information that is continuously arriving during the development effort</li>\n</ul>\n</li>\n<li>\n<p>Measure progress by validating working assets</p>\n<ul>\n<li>Can we really claim success if we finish on time and on budget and yet fail to meet customer expectations?</li>\n<li>With Scrum, we measure progress by building working, validated assets that deliver value and that can be used to validate important assumptions.</li>\n</ul>\n</li>\n<li>\n<p>Focus on value-centric delivery</p>\n<ul>\n<li>A customer-value-centric form of development… is based on a prioritized, incremental model of delivery in which the highest-value features are continuously build and delivered in the next iteration.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Performance</p>\n<ul>\n<li>\n<p>Go fast but never hurry</p>\n<ul>\n<li>In Scrum, one core goal is to be nimble, adaptable, and speedy. By going fast, we deliver fast, we get feedback fast, and we get value into the hands of our customers sooner. Learning and reacting quickly allow us to generate revenue and/or reduce costs sooner.</li>\n<li>In Scrum, time is of the essence but we don’t rush to get things done. </li>\n</ul>\n</li>\n<li>\n<p>Sustainable pace</p>\n<ul>\n<li>People should be able to work at a pace that they can continue for an extended period of time</li>\n</ul>\n</li>\n<li>\n<p>Build in quality</p>\n<ul>\n<li>Each increment of value that is created is completed to a high level of confidence and has the potential to be put into production or shipped to customers</li>\n</ul>\n</li>\n<li>\n<p>Employ minimally sufficient ceremony</p>\n<ul>\n<li>In Scrum, our goal is to eliminate unnecessary formality. Therefore, we set the ceremonial bar at a low level, one that is minimally sufficient or good enough.</li>\n</ul>\n</li>\n<li>\n<p>Scrum isn’t anti-documentation:</p>\n<ul>\n<li>We adopt an economic perspective and carefully review which documents we create. </li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h2><em>Essential Scrum: A Practical Guide to the Most Popular Agile Process</em> by Kenneth S. Rubin</h2>\n<p>This book summary captures the high-level, conceptual framework of Scrum. The remainder of the book discusses it’s implementation. If you’re a technical manager or leader interested in implementing Scrum in your organization, I recommend reading <a href=\"https://amzn.to/39cryel\">Essential Scrum: A Practical Guide to the Most Popular Agile Process by Kenneth S. Rubin</a>.</p>","frontmatter":{"title":"Essential Scrum by Kenneth S. Rubin","date":"April 15, 2019","description":"Scrum is the most popular agile process, and Essential Scrum by Kenneth S. Rubin is arguably the most popular book on the topic. The problem that Scrum seeks to solve is how do we empower teams to identify and solve their own problems?"}}},"pageContext":{"slug":"/book summary/essential-scrum-kenneth-rubin/","previous":{"fields":{"slug":"/book summary/agile-retrospectives-esther-derby-diana-larsen/"},"frontmatter":{"title":"Agile Retrospectives by Esther Derby and Diana Larsen"}},"next":{"fields":{"slug":"/puzzle-video-games-problem-solving/"},"frontmatter":{"title":"Best Puzzle Video Games to Level Up Problem Solving Skills"}}}}