{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com","author":"Jared Nielsen"}},"markdownRemark":{"id":"59a034a7-a291-5a5c-a06f-b82d6acfeb73","excerpt":"Here is a list of the best newsletters for web developers in 2019. By best I mean  my favorite . Of the many great newsletters available for web developers…","html":"<p>Here is a list of the best newsletters for web developers in 2019.</p>\n<p>By best I mean <em>my favorite</em>.</p>\n<p>Of the many great newsletters available for web developers, these are the 10 that I find give me a well-rounded perspective on current trends and must-know developments in our field with minimal redundancy and maximal entertainment value.</p>\n<h2>Hacker Newsletter</h2>\n<p>If you subscribe to only one newsletter, this is it. It’s all here.</p>\n<p>📨 <a href=\"https://hackernewsletter.com/\">Hacker Newsletter</a></p>\n<h2>TL;DR</h2>\n<p><em>TL;DR</em> is a daily dose of tech news curated for web developers. There are of course links to the big stories but also interesting GitHub repos and projects.</p>\n<p>📨 <a href=\"https://www.tldrnewsletter.com/\">TL;DR</a></p>\n<h2>Pony Foo Weekly</h2>\n<p>The <em>Pony Foo</em> newsletter is great for its cross-cutting aggregation of recent developments in web development with the added benefit of arriving earlier in the week than others. It’s also</p>\n<p>📨 <a href=\"https://ponyfoo.com/weekly\">Pony Foo Weekly</a></p>\n<h2>JavaScript Weekly</h2>\n<p>In addition to updates on the rapidly evolving JavaScript ecosystem, this newsletter is loaded with tutorials for every skill level as well as links to new and interesting projects. And if you want to really nerd out, you can sign up for its sister publications, <a href=\"https://nodeweekly.com/\">Node Weekly</a> and <a href=\"https://react.statuscode.com/\">React Status</a>, but note that the most important stories bubble up to <em>JavaScript Weekly</em>.</p>\n<p>📨 <a href=\"https://javascriptweekly.com/\">JavaScript Weekly</a></p>\n<h2>Python Weekly</h2>\n<p>If you’re a JS developer looking for a second language to learn, might I suggest Python? This newsletter is consistently good and if you’re interested in machine learning, you’ll find great resources for all levels.</p>\n<p>📨 <a href=\"https://www.pythonweekly.com/\">Python Weekly</a></p>\n<h2>Pointer</h2>\n<p><em>Pointer</em> tends to address concerns related to management, both inter- and intra- personal. There is something perspective-changing in every issue, no matter where you are in your career trajectory as a web developer.</p>\n<p>📨 <a href=\"http://www.pointer.io/\">Pointer</a></p>\n<h2>History of the Web</h2>\n<p>There is no urgency in reading this newsletter as it is all old news, but it is definitely in the need-to-know category. Each issue is a deep-dive into a ‘forgotten’ history of the web. The issues are always fascinating and always informative.</p>\n<p>📨 <a href=\"https://thehistoryoftheweb.com/\">History of the Web</a></p>\n<h2>Mozilla Developer Newsletter</h2>\n<p>The <em>MDN</em> newsletter rounds out those listed above with links to resources for noobs and pros on accessibility, privacy, performance and beyond. Bonus: weekly developer tools tips (but for Firefox, naturally).</p>\n<p>📨 <a href=\"https://www.mozilla.org/en-US/newsletter/developer/\">Mozilla Developer Newsletter</a></p>\n<h2>Programming Digest</h2>\n<p>This understated missive is excellent in its lean curation of high-level, language-agnostic articles on its stated topic. One of my favorite weekend reads, I look forward to its arrival every Sunday morning.</p>\n<p>📨 <a href=\"https://programmingdigest.net/\">Programming Digest</a></p>\n<h2><a href=\"https://labnotes.org/\">Weekend Reads</a></h2>\n<p>Last but not least, the newsletter that equips me with memes for Monday. It’s a humorous mix of tweets, videos and GIFs (mostly) related to web development.</p>\n<p>📨</p>\n<h2>📰 Best Newsletters for Web Developers?</h2>\n<p>What are your best newsletters? Let me know <a href=\"https://twitter.com/jarednielsen\">@jarednielsen</a></p>\n<p><em>Producing and publishing a professional newsletter is a time-consuming process requiring careful consideration of both content and layout. If you become a subscriber to any of the above, say thanks by checking out their sponsor offerings or consider making a contribution.</em></p>","frontmatter":{"title":"Best Newsletters for Web Developers in 2019","date":"December 24, 2018","description":"Here is a list of the best newsletters for web developers in 2019. By best I mean my favorite."}}},"pageContext":{"slug":"/2019-best-newsletters-web-developers/","previous":{"fields":{"slug":"/advice-coding-bootcamp-students/"},"frontmatter":{"title":"Advice for Coding Bootcamp Students"}},"next":{"fields":{"slug":"/install-nvidia-cuda-linux-blender-cycles/"},"frontmatter":{"title":"How to Install NVIDIA Cuda Toolkit on Linux for Blender 2.8 Cycles"}}}}