{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com","author":"Jared Nielsen"}},"markdownRemark":{"id":"d245eff2-0fff-5446-8109-4a1b434e230d","excerpt":"I’m an entirely self-taught developer. It was a long and circuitous journey to get from noob to pro. I wish the coding bootcamp model existed when I was…","html":"<p><img src=\"\" alt=\"Advice for Coding Bootcamp Students\"></p>\n<p>I’m an entirely self-taught developer. It was a long and circuitous journey to get from noob to pro. I wish the coding bootcamp model existed when I was learning, primarily to focus my efforts and secondarily to plug me into a network. It’s not for everyone, but I’ve seen that it works. I currently teach a coding bootcamp at a prominent university, and after graduating six cohorts in full stack web development and data visualization, I’ve observed a few things that set successful students apart. Here is my advice for coding bootcamp students.</p>\n<p><em>Disclaimer &#x26; disclosure: These views are my own and do not necessarily reflect those of my employer.</em></p>\n<h2>Add</h2>\n<p>To your resume you will be adding the hard skills of your tech stack, but more importantly, you will be adding the soft skills of teamwork and translation. These are the tools of your new trade. Keep them sharp.</p>\n<h3>…To Your Skill Set</h3>\n<p>Do algorithms.</p>\n<p>Every day.</p>\n<p>You’re like, “What’s the real world application of checking whether or not a string is a palindrome?”</p>\n<p>Algorithms provide a bounded environment in which to exercise (and acquire) programming chops. Unlike projects, which may take days or weeks, algorithms, in the best case, take only a few minutes, in the worst, a few hours.</p>\n<p>Think of it in terms of training for a marathon. A runner doesn’t show up on race day and expect to win. There were countless ‘pointless’ hours on treadmills and tracks in preparation for the event.</p>\n<p>You don’t need to be a mathematical whiz but you do need to feel comfortable thinking through the solution to a problem using a programming language. When applying for jobs, most of my students are given coding challenges. These challenges are basically algorithms or data structures disguised as story problems. If you can see through the noise, you can quickly implement an elegant solution.</p>\n<p>Practice makes practice.</p>\n<h3>…To Your Portfolio</h3>\n<p>Start your own projects.</p>\n<p>Now.</p>\n<p>With what you know.</p>\n<p>Don’t wait until you feel ready. When you finally do feel ready, it will be too late.</p>\n<p>Don’t limit yourself to the homework and group projects assigned during the course. My most successful students started their own side projects and explored technology and concepts that we didn’t have time to cover in class. They got obsessed.</p>\n<p>Let the bug bite you.</p>\n<p>This is how you build a portfolio that will set you apart from all other coding bootcamp students. You want to show off more than hangman or a to-do list.</p>\n<h3>…To Your Network</h3>\n<p>This is where I see a lot of stronger students fail. They generally arrive with some programming background and are frustrated with their peers who are beginners. They choose to work alone, depriving themselves of the most important assets and lessons a bootcamp provides: the people.</p>\n<p>It doesn’t take savvy students long to realize that what they are really paying for is not the codebase, but their colleagues.</p>\n<p>This is the beginning of your professional network.</p>\n<p>Make friends.</p>\n<p>Build community.</p>\n<p>Learn how to work on a team.</p>\n<p>Better yet, learn how to lead a team.</p>\n<h2>Commit</h2>\n<p>Many of my best students were those who struggled with the basics in the beginning. What set them apart was commitment. The bootcamp was do or die for them. They were going to succeed no matter what. The students who most often fail are those who arrive with an ‘academic’ mindset, approaching the bootcamp like a college course, concerned only with a grade and doing the bare minimum to earn it. Yes, the certificate is important, but more important is knowledge acquisition. You are not just committing to a bootcamp for <em>x</em> number of months. You are committing to a new life for <em>y</em> number of years.</p>\n<h3>…To The Time Required</h3>\n<p>It’s hard enough to survive the day-to-day, especially if you have a family and a job, but it’s imperative that you find a way to carve out large blocks of time everyday to do deep work in the zone. Adapt your schedule to your flow. Establish a routine and stick to it.</p>\n<p>It’s only a few months. Put your old life on hold so you can start a new one.</p>\n<p>Don’t let your bad habits kill your dreams.</p>\n<p>You made a sacrifice.</p>\n<p>Make it count.</p>\n<h3>…To Do The Work</h3>\n<p>Do the work.</p>\n<p>More importantly, do your own work.</p>\n<p>Don’t cheat.</p>\n<p>Yes, it’s tempting to clone that repo, disguise the code a bit, and submit it as your own.</p>\n<p>You’re only hurting yourself.</p>\n<p>A certificate and a glossy portfolio might get your foot in the door for an interview, but what are you going to do when they ask you technical questions?</p>\n<p>I promise you the answer is not <code class=\"language-text\">CTRL+C/CTRL+V</code>.</p>\n<p>When searching for a solution and you find it in the docs or on Stack, don’t copy/paste it. Type it out. Use your fingers to put it in your brainstem. Do your best to understand what is happening under the hood. You can get by simply using examples, but you will benefit in the long run by taking the time to understand why it works.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/RTFM\">RTFM</a>.</p>\n<p>It’s fantastic.</p>\n<h3>…To a Growth Mindset</h3>\n<p>Programming is problem-solving.</p>\n<p>It’s not hard.</p>\n<p>It’s not magic.</p>\n<p>It <em>is</em> challenging.</p>\n<p>Embrace the challenge.</p>\n<p>It’s the challenge that will sustain you in your career.</p>\n<p>Fall in love with problem-solving.</p>\n<p>Use these <a href=\"http://jarednielsen.com/teach-adults-code/\">heuristics to cultivate a problem-solving mindset</a>:</p>\n<ol>\n<li>Define the Problem</li>\n<li>Devise a Plan</li>\n<li>Execute the Plan</li>\n<li>Examine the Solution</li>\n</ol>\n<p>(If your instructor isn’t using a similar approach with you on day one, drop out immediately. He or she is wasting your time and money.)</p>\n<p>Remember that everyone learns at different rates for different things. Don’t compare yourself to your peers, only to your personal progress. Bootcamp is a means, not an end. You are now a lifelong learner.</p>\n<h2>Push</h2>\n<p>My most successful students begin with the end in mind and are continually building their portfolios, fine-tuning their resumes, and applying for jobs before they feel ready. Even so, leaving the nest and returning to the real world will feel scary.</p>\n<h3>…To Master</h3>\n<p>You will feel like an impostor.</p>\n<p>You may feel like an impostor for a long time.</p>\n<p>The dirty secret of software development? We’re all impostors. And we’re okay with that.</p>\n<p>It’s impossible to gain mastery over everything. The field is too broad and the pace of change too rapid.</p>\n<p>The most valuable skill you can acquire is the ability to solve problems.</p>\n<p>To beat impostor syndrome, pick one topic and do a deep dive into it. Then build a project using, or write an article about, that topic. Then move on to the next thing. Each time you repeat this process, you are putting another stake in the ground and expanding your territory.</p>\n<p>The day will come when you realize that mastery is confidence in your ability to quickly teach yourself the skills required to solve any given problem.</p>\n<p>It’s important to engage professionals outside the context of bootcamp. Go to meetups and hackathons, talk to people.</p>\n<p>You will realize you know more than you think you know.</p>\n<h3>…Past</h3>\n<p>The life you were living prior to coding bootcamp is the key to your future.</p>\n<p>The skills you carry from your previous career, coupled with your newly acquired technical chops, make you invaluable and highly desirable to a particular employer.</p>\n<p>You fill a very specific niche.</p>\n<p>Build bridges between worlds.</p>\n<p>Become a translator.</p>\n<h3>…Yourself</h3>\n<p>Like writing a function, it’s up to you to determine the output of your experience.</p>\n<p>Push yourself.</p>\n<p>But not too hard.</p>\n<p>Just hard enough.</p>\n<p>Don’t forget to care for yourself.  </p>\n<p>Sleep. Eat well. Exercise. Take breaks.</p>\n<p>That last point is extremely important. You are still a person in the world.</p>\n<p>Tend to your relationships.</p>\n<p>They are more important than any code you will write during the coding bootcamp.</p>\n<p>(The added bonus to taking breaks is that insights into tricky problems will present themselves out of the blue. But don’t let your friends and family know that’s the truth of the matter 😜)</p>\n<h2>Final Piece of Advice for Coding Bootcamp Students</h2>\n<p>Ask yourself if a life in code is right for you. The majority of my students successfully make career transitions. Unfortunately, there are those who realize too late that they made the wrong decision. A coding bootcamp is costly in both time and money, so do your homework. Be sure that you understand the difference between UX/UI, full stack web development, and data visualization (or whatever it is you are learning). Do preliminary research into the language(s) you will be learning and the career paths it will afford you. Is this what you really want to do? You don’t have to learn to code to be successful. But you still need to <code class=\"language-text\">add</code>, <code class=\"language-text\">commit</code> and <code class=\"language-text\">push</code> to get where you want to be.</p>\n<p>Good luck!</p>","frontmatter":{"title":"Advice for Coding Bootcamp Students","date":"December 17, 2018","description":"Considering a coding bootcamp? Already enrolled? Here’s my advice for coding bootcamp students to ensure a successful career transition."}}},"pageContext":{"slug":"/advice-coding-bootcamp-students/","previous":{"fields":{"slug":"/teach-adults-code/"},"frontmatter":{"title":"How to Teach Adults to Code"}},"next":null}}