{"data":{"site":{"siteMetadata":{"title":"jarednielsen.com"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"One of the most useful aspects of Git is the ability for developers to create branches of a project to test new features and fix bugs…","fields":{"slug":"/learn-git-branch-workflow/"},"frontmatter":{"date":"February 11, 2019","title":"Learn Git Branch Workflow","description":"The Git branch workflow allows developers to create branches of a project to test new features and fix bugs without modifying code in production. In this tutorial, you will learn Git branch workflow basics and best practices."}}},{"node":{"excerpt":"The most powerful, and sometimes powerfully frustrating, aspect of Git is the collaborative workflow it enables. In order to  really  learn…","fields":{"slug":"/learn-git-workflow-centralized/"},"frontmatter":{"date":"February 04, 2019","title":"Learn Git Workflow Centralized Collaboration","description":"In order to learn Git workflow, you need to work with a team. This tutorial introduces the centralized model for collaboration and is designed for two to work through together."}}},{"node":{"excerpt":"Whether you’re learning full stack web development, machine learning or something else entirely, you’re going to need to learn Git workflow…","fields":{"slug":"/learn-git-workflow-basics/"},"frontmatter":{"date":"January 28, 2019","title":"Learn Git Workflow Basics","description":"Whether you're learning full stack web development, machine learning or something else entirely, you're going to need to learn Git workflow basics."}}},{"node":{"excerpt":"My preferred development environment is Linux and my preferred approach to upgrading my distro is a clean install. This means with each…","fields":{"slug":"/full-stack-development-linux/"},"frontmatter":{"date":"January 21, 2019","title":"How to Configure Full-Stack Development Environment for Linux","description":"A quick reference for setting up a full-stack development environment on Linux, including instructions for Git, Node.js, MySQL, MongoDB and more."}}},{"node":{"excerpt":"If you’ve used jQuery’s AJAX, the fetch API, or Axios for HTTP requests, you’ve used JavaScript Promises. When you’re first learning web…","fields":{"slug":"/javascript-promises/"},"frontmatter":{"date":"January 14, 2019","title":"Learn JavaScript Promises and Promise Methods","description":"Resolve to learn how JavaScript Promises work this year. This tutorial will introduce you to the Promise object and the resolve, reject, finally, all and race Promise methods."}}},{"node":{"excerpt":"Installing the NVIDIA Cuda Toolkit on Linux for Blender Cycles rendering is actually easy and straightforward. Unfortunately, the NVIDIA…","fields":{"slug":"/install-nvidia-cuda-linux-blender-cycles/"},"frontmatter":{"date":"January 07, 2019","title":"How to Install NVIDIA Cuda Toolkit on Linux for Blender 2.8 Cycles","description":"Installing the NVIDIA Cuda Toolkit on Linux for Blender Cycles rendering is straightforward and much easier than the official documentation leads you to believe."}}},{"node":{"excerpt":"By best I mean my favorite. <aside> : I would like to express gratitude for the folks behind each of these newsletters. 👏👏👏 If you like…","fields":{"slug":"/2019-best-newsletters-web-developers/"},"frontmatter":{"date":"December 24, 2018","title":"Best Newsletters for Web Developers in 2019","description":null}}},{"node":{"excerpt":"I teach a coding bootcamp at a prominent university. After graduating six cohorts and more than 100 individuals in full stack web…","fields":{"slug":"/advice-coding-bootcamp-students/"},"frontmatter":{"date":"December 17, 2018","title":"Advice for Coding Bootcamp Students","description":"Considering a coding bootcamp? Already enrolled? Here’s my advice for coding bootcamp students to ensure a successful career transition."}}},{"node":{"excerpt":"My first full-time job was teaching wilderness survival to adjudicated youth in the deserts of Utah. Though the technologies were primitive…","fields":{"slug":"/teach-adults-code/"},"frontmatter":{"date":"December 10, 2018","title":"How to Teach Adults to Code","description":"When we teach adults to code, we ensure success by cultivating a growth mindset with problem-solving heuristics, articulate language and fun."}}},{"node":{"excerpt":"GatsbyJS is a great option for a static site generator, even if you’re unfamiliar with React. It’s very easy to use, super snappy, and has a…","fields":{"slug":"/deploy-gatsbyjs-github-pages-user/"},"frontmatter":{"date":"November 26, 2018","title":"How to Deploy a GatsbyJS Blog on GitHub Pages as a User Site","description":"Hosting a GatsbyJS blog on GitHub Pages for your user site requires additional configuration. Here's how to deploy."}}}]}},"pageContext":{}}